app/Controllers/Admin/AdminDashboard.php

    public function index()
    {
        $check = $this->checkAdmin();
        if ($check) return $check;

        $totalUsers = $this->userModel->countAll();
        $goldUsers = $this->userModel->where('is_gold', 1)->countAllResults();
        $totalRegimes = $this->regimeModel->countAll();
        $totalActivites = $this->activiteModel->countAll();
        $totalCodes = $this->codeModel->countAll();

        $data = [
            'total_users'    => $totalUsers,
            'gold_users'     => $goldUsers,
            'total_regimes'  => $totalRegimes,
            'total_activites' => $totalActivites,
            'total_codes'    => $totalCodes,
            'users'          => $this->userModel->orderBy('created_at', 'DESC')->limit(10)->findAll(),
---
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_gold` = 1
AND `users`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows` FROM `regimes`
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 10