app/Controllers/Auth.php

            'created_at' => date('Y-m-d H:i:s'),
        ];

        if ($this->userModel->insert($newUser)) {
---
INSERT INTO `users` (`nom`, `email`, `genre`, `taille`, `poids`, `imc`, `password`, `profile_completed`, `created_at`, `updated_at`) VALUES ('Windy Adriane', 'windy.adriane@gmail.com', 'F', 160, 45, 17.58, '$2y$12$4bnZLUJ.uienki23Tfu8Qu0uqaZ6HCewOVs503ANVpp2D6C61zHfG', 0, '2026-05-09 15:55:06', '2026-05-09 15:55:06')

    public function loginPost()
    {
        $rules = [
            'email'    => 'required|valid_email',
            'password' => 'required',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $this->userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'jean@test.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1