app/Controllers/Dashboard.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '1'
SELECT *
FROM `regimes`
WHERE `regimes`.`deleted_at` IS NULL
---
    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/auth/login');
        }

        $userId = session()->get('user_id');
        $user = $this->userModel->find($userId);
        $objectives = $this->objectiveModel->getUserObjectives($userId);
        $regimes = $this->regimeModel->findAll();

SELECT *
FROM `regimes`
WHERE `regimes`.`deleted_at` IS NULL
AND `regimes`.`id` = '1'
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '1'
---
    public function subscribeRegime()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/auth/login');
        }

        $userId = session()->get('user_id');
        $regimeId = $this->request->getPost('regime_id');
        $dureeJours = (int)$this->request->getPost('duree_jours') ?? 30;

        $regime = $this->regimeModel->find($regimeId);
        if (!$regime) {
            return redirect()->back()->with('error', 'Régime non trouvé.');
        }

        $user = $this->userModel->find($userId);

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '1'
UPDATE `users` SET `is_gold` = 1, `gold_purchased_at` = '2026-05-09 18:05:42', `wallet_balance` = 20.01, `updated_at` = '2026-05-09 18:05:42'
WHERE `users`.`id` IN ('1')
---
    public function upgradeGold()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/auth/login');
        }

        $userId = session()->get('user_id');
        $user = $this->userModel->find($userId);

        if ($user['is_gold']) {
            return redirect()->back()->with('info', 'Vous êtes déjà premium!');
        }

        $goldPrice = 29.99; // Price for gold subscription

        if ($user['wallet_balance'] < $goldPrice) {
            return redirect()->back()->with('error', 'Solde insuffisant. Veuillez ajouter des fonds.');
        }

        // Purchase gold
        $this->userModel->update($userId, [
            'is_gold'           => 1,
            'gold_purchased_at' => date('Y-m-d H:i:s'),
            'wallet_balance'    => $user['wallet_balance'] - $goldPrice,
        ]);