app/Models/ObjectiveModel.php

    public function getUserObjectives(int $userId)
    {
        return $this->where('user_id', $userId)->findAll();
---
SELECT *
FROM `objectives`
WHERE `user_id` = 1