app/Models/RegimeModel.php

    public function calculatePrice(int $regimeId, int $dureeJours): float
    {
        $regime = $this->find($regimeId);
---
SELECT *
FROM `regimes`
WHERE `regimes`.`deleted_at` IS NULL
AND `regimes`.`id` = 1